engineer-ae3o/stm32-hal-library/components/test/src/i2s.cpp
#include "stm32f411xe.h"
#include "Unity/unity.h"

#include "drivers/spi_internals.h" // Reaching into i2s.c's own internal header -- see note below
#include "utils/common.h"
#include "drivers/gpio.h"
#include "drivers/dma.h"
#include "drivers/i2s.h"
#include "test/i2s.hpp"
#include "utils/tick.h"
#include "utils/err.h"
#include "utils/log.h"

#include <array>
#include <cstdint>
#include <utility>


// ASSUMPTIONS THAT NEED CONFIRMING AGAINST YOUR board.h / CMSIS HEADERS BEFORE THIS COMPILES:
//   1. BOARD_I2S2_WS_*, BOARD_I2S2_SCLK_*, BOARD_I2S2_SD_*, BOARD_I2S2_MCLK_* macros below are
//      guessed from the F411's standard I2S2 AF5 muxing (WS=PB12, CK=PB10, SD=PB15, MCK=PC6).
//      Swap in whatever your board.h actually calls them.
//   2. SPI_I2SCFGR_I2SE is assumed to be the enable bit name (standard CMSIS naming) -- used only
//      to check the peripheral is left disabled after deinit/dbm_stop.
//   3. DMA_Stream_TypeDef's transfer-count register is assumed to be named NDTR (standard CMSIS
//      naming for STM32F4), used only in the 24/32-bit size-doubling check.
//   4. I2S1 and I2S5 are assumed to have no DMA streams mapped, mirroring SPI1/SPI5 in the SPI
//      driver, since both share spi_master_get_dma_stream_map(). Confirm against your dma map.
//   5. Three tests (the 24/32-bit doubling check and both DBM tests) call spi_master_get_dma_stream_map()
//      directly to read the DMA stream's NDTR/CR registers, since the public i2s.h API has no way to
//      observe DMA transfer state. That function lives in drivers/spi_internals.h -- i2s.c's own
//      internal header, not part of the public surface. Reaching into it from a test file is a
//      deliberate trade-off (real introspection vs. a clean public/private boundary); if that's not
//      acceptable, those three tests need a different way to observe "is the stream still running"
//      and "which half-buffer just filled" -- e.g. exposing a small read-only accessor from the driver.

namespace test::i2s {

    namespace {

        constexpr const char* TAG = "I2S_Test";

        // Primary instance under test. I2S2 == SPI2 silicon, which is already known DMA-capable
        // from the SPI driver tests. Nothing needs to be connected to WS/SCLK/SD/MCLK for any
        // test in this file -- see the module comment in the PR/README for why.
        I2S_TypeDef* const TEST_INSTANCE = I2S2;

        GPIO_TypeDef* const  MCLK_PORT = GPIOC;
        constexpr gpio_pin_t MCLK_PIN  = GPIO_PIN_6;

        const i2s_master_config_t DEFAULT_TX_CONFIG = {
            .direction   = I2S_DIR_HALF_DUPLEX_TX,
            .mode        = I2S_MODE_PHILIPS,
            .frequency   = I2S_FREQ_48kHz,
            .frame       = I2S_DATA_16_BITS_FRAME_16_BITS,
            .audio_clock = AUDIO_PLL_76_8MHz,
            .cpol        = false,
            .use_mck     = false,
            .ws_pin      = BOARD_I2S2_WS_PB12,
            .sd_pin      = BOARD_I2S2_SD_PB15,
            .mclk_pin    = BOARD_I2S2_MCLK_PC6,
            .sclk_pin    = BOARD_I2S2_SCLK_PB10,
        };

        const i2s_master_config_t DEFAULT_RX_CONFIG = [] {
            i2s_master_config_t cfg = DEFAULT_TX_CONFIG;
            cfg.direction           = I2S_DIR_HALF_DUPLEX_RX;
            return cfg;
        }();

        // Helpers
        volatile bool      s_tx_done = false;
        volatile hal_err_t s_tx_err  = HAL_OK;
        inline void        tx_done_callback(void*, hal_err_t err) {
            s_tx_err  = err;
            s_tx_done = true;
        }

        volatile bool      s_rx_done = false;
        volatile hal_err_t s_rx_err  = HAL_OK;
        inline void        rx_done_callback(void*, hal_err_t err) {
            s_rx_err  = err;
            s_rx_done = true;
        }

        volatile int s_dbm_completions = 0;
        inline void  dbm_callback(void*, hal_err_t) {
            s_dbm_completions += 1;
        }

        inline bool wait_for(volatile bool& flag) {
            uint32_t timeout = TIMEOUT;
            while (!flag && --timeout);
            return flag;
        }

        inline bool wait_for_count(volatile int& counter, int target) {
            uint32_t timeout = TIMEOUT;
            while (counter < target && --timeout);
            return counter >= target;
        }

        inline uint32_t get_gpio_moder(GPIO_TypeDef* port, gpio_pin_t pin) {
            return (port->MODER >> (std::to_underlying(pin) * 2U)) & 0b11U;
        }

        // TESTS
        void invalid_arg_guards() {
            std::array<uint16_t, 4> data{};
            std::array<uint16_t, 4> rx_buf{};
            uint8_t                 buffer_idx = 0;

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2sx_clk_enable(reinterpret_cast<I2S_TypeDef*>(0x1), true));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_init(nullptr, &DEFAULT_TX_CONFIG));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_init(TEST_INSTANCE, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_deinit(nullptr));

            auto* const bogus_handle = reinterpret_cast<I2S_TypeDef*>(0x1);
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dma_init(bogus_handle, DMA_PRIORITY_LOW));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dma_deinit(bogus_handle));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_transmit_oneshot(bogus_handle, data.data(), data.size(), nullptr, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_transmit_oneshot(TEST_INSTANCE, nullptr, data.size(), nullptr, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_transmit_oneshot(TEST_INSTANCE, data.data(), 0, nullptr, nullptr));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_receive_oneshot(bogus_handle, rx_buf.data(), rx_buf.size(), nullptr, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_receive_oneshot(TEST_INSTANCE, nullptr, rx_buf.size(), nullptr, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_receive_oneshot(TEST_INSTANCE, rx_buf.data(), 0, nullptr, nullptr));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_init(bogus_handle, data.data(), rx_buf.data(), data.size(), dbm_callback, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_init(TEST_INSTANCE, nullptr, rx_buf.data(), rx_buf.size(), dbm_callback, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_init(TEST_INSTANCE, rx_buf.data(), nullptr, rx_buf.size(), dbm_callback, nullptr));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_init(TEST_INSTANCE, rx_buf.data(), rx_buf.data(), 0, dbm_callback, nullptr));
            // Callback is mandatory for double buffering: it's the only way to know which buffer is free
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_init(TEST_INSTANCE, rx_buf.data(), rx_buf.data(), rx_buf.size(), nullptr, nullptr));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_deinit(bogus_handle));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_start(bogus_handle));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_stop(bogus_handle));

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_get_filled_buffer(bogus_handle, &buffer_idx));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_dbm_get_filled_buffer(TEST_INSTANCE, nullptr));
        }

        void init_rejects_invalid_audio_clock_without_touching_registers() {
            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.audio_clock         = static_cast<audio_clock_t>(0xFF);

