engineer-ae3o/stm32-hal-library/components/test/src/i2s.cpp
            const uint32_t i2scfgr_before = TEST_INSTANCE->I2SCFGR;
            const uint32_t i2spr_before   = TEST_INSTANCE->I2SPR;

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, i2s_master_init(TEST_INSTANCE, &config));

            // The switch on audio_clock is the very first thing init does, before any register
            // write, so an unrecognized value must leave the peripheral completely untouched.
            TEST_ASSERT_EQUAL_UINT32(i2scfgr_before, TEST_INSTANCE->I2SCFGR);
            TEST_ASSERT_EQUAL_UINT32(i2spr_before, TEST_INSTANCE->I2SPR);
        }

        void init_rejects_prescaler_below_the_supported_range() {
            // Forces i2sdiv < 2: a high nominal sample rate relative to the audio clock, with MCK
            // enabled (multiplier 256), pushes the divisor down below the minimum the hardware supports.
            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.audio_clock         = AUDIO_PLL_172MHz;
            config.use_mck             = true;
            config.frequency           = static_cast<i2s_freq_t>(200'000); // Not a real audio rate, chosen to hit the boundary

            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_init(TEST_INSTANCE, &config));
        }

        void init_rejects_prescaler_above_the_supported_range() {
            // Forces i2sdiv > UINT8_MAX: a very low nominal sample rate against a fast audio clock
            // multiplier blows the divisor past what the 8-bit I2SDIV field can hold.
            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.audio_clock         = AUDIO_PLL_76_8MHz;
            config.use_mck             = false;
            config.frame               = I2S_DATA_16_BITS_FRAME_16_BITS; // multiplier 32
            config.frequency           = static_cast<i2s_freq_t>(500);

            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_init(TEST_INSTANCE, &config));
        }

        void deinit_clears_control_registers() {
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &DEFAULT_TX_CONFIG));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));

            TEST_ASSERT_FALSE(TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_I2SE);
            TEST_ASSERT_EQUAL_UINT32(0,
                                     TEST_INSTANCE->I2SCFGR & (SPI_I2SCFGR_I2SCFG | SPI_I2SCFGR_CKPOL | SPI_I2SCFGR_CHLEN | SPI_I2SCFGR_I2SSTD |
                                                               SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_PCMSYNC));
            TEST_ASSERT_EQUAL_UINT32(0, TEST_INSTANCE->I2SPR & (SPI_I2SPR_I2SDIV | SPI_I2SPR_ODD | SPI_I2SPR_MCKOE));

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void init_programs_i2smod_direction_mode_and_polarity() {
            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.direction           = I2S_DIR_HALF_DUPLEX_TX;
            config.mode                = I2S_MODE_LEFT_JUSTIFIED;
            config.cpol                = true;

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));

            TEST_ASSERT_TRUE(TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_I2SMOD);
            TEST_ASSERT_EQUAL_UINT32(std::to_underlying(I2S_DIR_HALF_DUPLEX_TX),
                                     (TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_I2SCFG) >> SPI_I2SCFGR_I2SCFG_Pos);
            TEST_ASSERT_EQUAL_UINT32(std::to_underlying(I2S_MODE_LEFT_JUSTIFIED),
                                     (TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_I2SSTD) >> SPI_I2SCFGR_I2SSTD_Pos);
            TEST_ASSERT_TRUE(TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_CKPOL);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));

            // Direction flips and polarity clears
            config.direction = I2S_DIR_HALF_DUPLEX_RX;
            config.cpol      = false;
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));
            TEST_ASSERT_EQUAL_UINT32(std::to_underlying(I2S_DIR_HALF_DUPLEX_RX),
                                     (TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_I2SCFG) >> SPI_I2SCFGR_I2SCFG_Pos);
            TEST_ASSERT_FALSE(TEST_INSTANCE->I2SCFGR & SPI_I2SCFGR_CKPOL);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void init_programs_the_configured_frame_size() {
            constexpr auto FRAMES = std::array{
                I2S_DATA_16_BITS_FRAME_16_BITS, I2S_DATA_16_BITS_FRAME_32_BITS, I2S_DATA_24_BITS_FRAME_32_BITS, I2S_DATA_32_BITS_FRAME_32_BITS};

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));

            for (const auto frame : FRAMES) {
                i2s_master_config_t config = DEFAULT_TX_CONFIG;
                config.frame               = frame;

                TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));
                TEST_ASSERT_EQUAL_UINT32(std::to_underlying(frame), TEST_INSTANCE->I2SCFGR & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN));
                TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            }

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void mclk_pin_only_programmed_when_use_mck_is_set() {
            const uint32_t mclk_mode_before = get_gpio_moder(MCLK_PORT, MCLK_PIN);

            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.use_mck             = false;

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));

            // use_mck == false: init must never touch the MCLK pin at all
            TEST_ASSERT_EQUAL_UINT32(mclk_mode_before, get_gpio_moder(MCLK_PORT, MCLK_PIN));
            TEST_ASSERT_FALSE(TEST_INSTANCE->I2SPR & SPI_I2SPR_MCKOE);

