engineer-ae3o/stm32-hal-library/components/test/src/i2s.cpp
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));

            config.use_mck = true;
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));

            // use_mck == true: MCLK pin goes to alternate function (0b10), and MCKOE gets set
            TEST_ASSERT_EQUAL_UINT32(0b10U, get_gpio_moder(MCLK_PORT, MCLK_PIN));
            TEST_ASSERT_TRUE(TEST_INSTANCE->I2SPR & SPI_I2SPR_MCKOE);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void clk_enable_toggles_the_correct_bus_bit() {
            i2sx_clk_enable(I2S1, false);
            TEST_ASSERT_FALSE(RCC->APB2ENR & RCC_APB2ENR_SPI1EN);
            i2sx_clk_enable(I2S1, true);
            TEST_ASSERT_TRUE(RCC->APB2ENR & RCC_APB2ENR_SPI1EN);
            i2sx_clk_enable(I2S1, false);

            i2sx_clk_enable(I2S2, false);
            TEST_ASSERT_FALSE(RCC->APB1ENR & RCC_APB1ENR_SPI2EN);
            i2sx_clk_enable(I2S2, true);
            TEST_ASSERT_TRUE(RCC->APB1ENR & RCC_APB1ENR_SPI2EN);
            // Leave I2S2 enabled: everything below needs it

            i2sx_clk_enable(I2S3, false);
            TEST_ASSERT_FALSE(RCC->APB1ENR & RCC_APB1ENR_SPI3EN);
            i2sx_clk_enable(I2S3, true);
            TEST_ASSERT_TRUE(RCC->APB1ENR & RCC_APB1ENR_SPI3EN);
            i2sx_clk_enable(I2S3, false);

            i2sx_clk_enable(I2S4, false);
            TEST_ASSERT_FALSE(RCC->APB2ENR & RCC_APB2ENR_SPI4EN);
            i2sx_clk_enable(I2S4, true);
            TEST_ASSERT_TRUE(RCC->APB2ENR & RCC_APB2ENR_SPI4EN);
            i2sx_clk_enable(I2S4, false);

            i2sx_clk_enable(I2S5, false);
            TEST_ASSERT_FALSE(RCC->APB2ENR & RCC_APB2ENR_SPI5EN);
            i2sx_clk_enable(I2S5, true);
            TEST_ASSERT_TRUE(RCC->APB2ENR & RCC_APB2ENR_SPI5EN);
            i2sx_clk_enable(I2S5, false);
        }

        void dma_init_rejects_unsupported_instances() {
            // I2S1 and I2S5 (== SPI1/SPI5) have no DMA streams mapped -- see the file-level assumption note
            i2sx_clk_enable(I2S1, true);
            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_dma_init(I2S1, DMA_PRIORITY_LOW));
            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_dma_deinit(I2S1));
            i2sx_clk_enable(I2S1, false);

            i2sx_clk_enable(I2S5, true);
            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_dma_init(I2S5, DMA_PRIORITY_LOW));
            TEST_ASSERT_EQUAL(HAL_ERR_NOT_SUPPORTED, i2s_master_dma_deinit(I2S5));
            i2sx_clk_enable(I2S5, false);
        }

        // ---- Tier 2: DMA plumbing. Nothing needs to be wired to WS/SCLK/SD/MCLK for any test
        // below -- the peripheral clocks real data out (or in, from whatever floats on the line)
        // regardless of what's downstream. These check the driver's bookkeeping, not audio content.

        void transmit_oneshot_completes_and_invokes_callback() {
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &DEFAULT_TX_CONFIG));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_init(TEST_INSTANCE, DMA_PRIORITY_HIGH));

            constexpr std::array<uint16_t, 8> TX_DATA = {0, 1, 2, 3, 4, 5, 6, 7};

            s_tx_done = false;
            s_tx_err  = HAL_FAIL;

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_transmit_oneshot(TEST_INSTANCE, TX_DATA.data(), TX_DATA.size(), tx_done_callback, nullptr));
            TEST_ASSERT_TRUE_MESSAGE(wait_for(s_tx_done), "I2S DMA oneshot TX never completed");
            TEST_ASSERT_EQUAL(HAL_OK, s_tx_err);

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void receive_oneshot_completes_and_invokes_callback() {
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &DEFAULT_RX_CONFIG));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_init(TEST_INSTANCE, DMA_PRIORITY_HIGH));

            std::array<uint16_t, 8> rx_buf{};

            s_rx_done = false;
            s_rx_err  = HAL_FAIL;

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_receive_oneshot(TEST_INSTANCE, rx_buf.data(), rx_buf.size(), rx_done_callback, nullptr));
            TEST_ASSERT_TRUE_MESSAGE(wait_for(s_rx_done), "I2S DMA oneshot RX never completed");
            TEST_ASSERT_EQUAL(HAL_OK, s_rx_err);
            // Content is meaningless with nothing driving SD -- only that it completed matters here

            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_deinit(TEST_INSTANCE));
            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, false));
        }

        void oneshot_rejects_a_call_while_a_transfer_is_still_in_flight() {
            // A deliberately slow bit clock (i2sdiv near mid-range, low nominal sample rate) plus a
            // large buffer keeps the DMA stream genuinely busy for milliseconds -- long enough to
            // reliably observe from software without faking any register state.
            i2s_master_config_t config = DEFAULT_TX_CONFIG;
            config.audio_clock         = AUDIO_PLL_172MHz;
            config.use_mck             = true;
            config.frequency           = static_cast<i2s_freq_t>(2'000);

            TEST_ASSERT_EQUAL(HAL_OK, i2sx_clk_enable(TEST_INSTANCE, true));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_init(TEST_INSTANCE, &config));
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_dma_init(TEST_INSTANCE, DMA_PRIORITY_LOW));

            static std::array<uint16_t, 2000> tx_data{};

            s_tx_done = false;
            TEST_ASSERT_EQUAL(HAL_OK, i2s_master_transmit_oneshot(TEST_INSTANCE, tx_data.data(), tx_data.size(), tx_done_callback, nullptr));

